Repository: SoftwareEngineering-WS2022-CoCoMonkeys/schoolexam-correction-ui
Catalog: src/lib/l10n/app_*.arb
Languages: de

# newGradingIntervalButton
source: new interval
de: Neues Intervall

# defaultGradingSchemeButton
source: grading scheme
de: Notenschema

source: grade
de: Note

source: points
de: Punkte

source: empty
de: leer

# gradingIntervalStart
source: from (exclusive)
de: Von (exklusive)

# gradingIntervalEnd
source: to (inclusive)
de: Bis (inklusive)

source: save
de: Speichern

source: Grading Table
de: Notenschlüssel

# oneToSixGradingScheme
source: Classic (1-6)
de: Klassisch (1-6)

# zeroToFifteenGradingScheme
source: Advanced (0-15)
de: Oberstufe (0-15)

# welcomeText
source: Welcome!
de: Willkommen!

# pleaseLogin
source: Please login to start correcting exams!
de: Bitte melden Sie sich an, um mit der Korrektur von Prüfungen zu beginnen.

source: username
de: Benutzername

source: password
de: Passwort

source: teacher
de: Lehrer

source: exam
de: Prüfung

# examPageName
source: exams
de: Prüfungen

# stateUnknown
source: unknown
de: Unbekannt

# statePlanned
source: planned
de: Geplant

# stateBuildReady
source: build ready
de: Build bereit

# stateSubmissionReady
source: submission ready
de: Einreichung bereit

# stateInCorrection
source: in correction
de: In Korrektur

# stateCorrected
source: corrected
de: Korrigiert

# statePublished
source: published
de: Veröffentlicht

# examCardState
source: state
de: Status

# examCardCourse
source: course
de: Kurs

# examCardTopic
source: topic
de: Fach

# examCardParticipants
source: # participants
de: Teilnehmende

# examCardQuota
source: quota
de: Korrigiert

# examPublish
source: publish
de: Veröffentlichen

# examPublishDate
source: publish date
de: Datum der Veröffentlichung

# examCardButtonCorrect
source: correct
de: Korrigieren

# examCardButtonUpload
source: upload
de: Hochladen

# examCardButtonEdit
source: edit
de: Anpassen

# newExamTitle
source: title
de: Titel

# newExamTopic
source: topic
de: Thema

# newExamCourse
source: course
de: Kurs

# newExamDate
source: exam date
de: Prüfungsdatum

# newExamButtonCreate
source: create
de: Erstellen

# newExamButtonEdit
source: edit
de: Anpassen

# newExamCardTitle
source: create exam
de: Prüfung erstellen

# editExamCardTitle
source: udpate exam
de: Prüfung anpassen

source: cancel
de: Abbrechen

source: yes
de: Ja

source: no
de: Nein

source: invalid value
de: Ungültiger Wert

# correctionSelectionConfirmWithName
source: Do you want to open the correction for student {name}?
de: Möchten sie die Korrektur von {name} öffnen?

source: correction
de: Korrektur

# taskRemarkEvaluate
source: evaluate
de: Bewerten

# taskRemarkPoints
source: points
de: Punkte

# loadingTitle
source: Loading
de: Lade

# errorTitle
source: Error
de: Fehler

# successTitle
source: Success
de: Erfolg

# authenticationError
source: The authentication failed.
de: Die Anmeldung ist fehlgeschlagen.

# updateExamError
source: The update failed.
de: Die Aktualisierung ist fehlgeschlagen.

# offlineError
source: You are offline. Please establish a working internet connection.
de: Sie sind offline. Bitte bauen Sie eine funktionierende Internetverbindung auf.

# loginAppError
source: An internal error occurred during the registration process.
de: Während der Anmeldung ist es zu einem internen Fehler gekommen.

# loginInternalError
source: An internal error occurred during the registration process. Please try the login again later.
de: Während der Anmeldung ist es zu einem internen Fehler gekommen. Bitte versuchen Sie die Anmeldung später erneut.

# loginBadRequestError
source: You have entered an invalid user name or password.
de: Sie haben einen ungültigen Benutzernamen oder ein ungültiges Passwort eingegeben.

# remarksGradingSuccess
source: The grading table was successfully updated.
de: Der Notenschlüssel wurde erfolgreich aktualisiert.

# remarksGradingLoading
source: Waiting for the update of the grading table.
de: Warte auf die Aktualisierung des Notenschlüssels.

# remarksGradingAppError
source: An internal error occurred while updating the grading table.
de: Während der Aktualisierung des Notenschlüssels ist es zu einem internen Fehler gekommen.

# remarksGradingInternalError
source: An internal error occurred while updating the grade table. Please try again later.
de: Während der Aktualisierung des Notenschlüssels ist es zu einem internen Fehler gekommen. Bitte versuchen Sie es später erneut.

# remarksGradingBadRequestError
source: The grading table you specified is invalid.
de: Der von Ihnen spezifizierte Notenschlüssel ist ungültig.

# remarksRemarkAppError
source: The update of {name} to {points} was not possible, due to an internal error.
de: Die Aktualisierung von {name} auf {points} ist durch einen internen Fehler nicht erfolgt.

# remarksRemarkInternalError
source: The update of {name} to {points} was not possible, due to an internal error. Please retry to a later time.
de: Die Aktualisierung von {name} auf {points} ist durch einen internen Fehler nicht erfolgt. Bitte versuchen Sie es später erneut.

# remarksRemarkBadRequestError
source: The update of {name} to {points} is invalid.
de: Die Aktualisierung von {name} auf {points} ist ungültig.

# examDetailsCreationLoading
source: Waiting for the creation of the exam {name}.
de: Warte auf die Erstellung der Klausur {name}.

# examDetailsCreationSuccess
source: {name} was successfully created.
de: {name} wurde erfolgreich erstellt.

# examDetailsCreationAppError
source: During the creation of {name}, an internal error occurred.
de: Während der Erstellung von {name} ist es zu einem internen Fehler gekommen.

# examDetailsCreationInternalError
source: During the creation of {name}, an internal error occurred. Please try the adjustment again later.
de: Während der Erstellung von {name} ist es zu einem internen Fehler gekommen. Bitte versuchen Sie die Anpassung später erneut.

# examDetailsCreationBadRequestError
source: The data you entered is invalid. Please check the data and restart the app if necessary.
de: Die von Ihnen eingegebenen Daten sind ungültig. Bitte überprüfen Sie die Daten und starten die App gegebenenfalls neu.

# examDetailsUpdateLoading
source: Waiting for the update of {name}.
de: Warte auf die Aktualisierung von {name}.

# examDetailsUpdateSuccess
source: {name} has been successfully updated.
de: {name} wurde erfolgreich aktualisiert.

# examDetailsUpdateAppError
source: During the adjustment of {name}, an internal error occurred.
de: Während der Anpassung von {name} ist es zu einem internen Fehler gekommen.

# examDetailsUpdateInternalError
source: During the adjustment of {name}, an internal error occurred. Please try the adjustment again later.
de: Während der Anpassung von {name} ist es zu einem internen Fehler gekommen. Bitte versuchen Sie die Anpassung später erneut.

# examDetailsUpdateBadRequestError
source: The data you entered is invalid. Please check the data and restart the app if necessary.
de: Die von Ihnen eingegebenen Daten sind ungültig. Bitte überprüfen Sie die Daten und starten die App gegebenenfalls neu.
